Autodesk.Revit.DB.Lighting.LineLightShape.#ctor(Autodesk.Revit.DB.Lighting.LineLightShape)
Creates a copy of the given line light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013